jack77er/openUTRUSTA/Packages/.cache/Keil.LPC4300_DFP.2.5.0.pdsc
    <condition id="CM4 ARM Compiler">
      <require condition="CM4"/>
      <require condition="ARM Compiler"/>
    </condition>

    <condition id="CM0APP ARM Compiler">
      <require condition="CM0"/>
      <deny    Pname="Cortex-M0 Sub"/>
      <require condition="ARM Compiler"/>
    </condition>
    <condition id="CM0SUB ARM Compiler">
      <require condition="CM0"/>
      <require Pname="Cortex-M0 Sub"/>
      <require condition="ARM Compiler"/>
    </condition>

    <condition id="LPC4300">
      <!-- conditions selecting Devices -->
      <description>NXP LPC4300 Series devices</description>
      <require Dvendor="NXP:11" Dname="LPC43??*"/>
    </condition>

    <condition id="LPC4300 CMSIS">
      <description>NXP LPC4300 Series devices and CMSIS-CORE and ARMCC compiler</description>
      <require condition="LPC4300"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <condition id="LPC4300 CMSIS SCU">
      <description>NXP LPC4300 with CMSIS and SCU</description>
      <require condition="LPC4300 CMSIS"/>
      <require Cclass="Device" Cgroup="SCU"/>
    </condition>

    <condition id="LPC4300 CMSIS RTOS SCU">
      <description>NXP LPC4300 with CMSIS, RTOS and SCU</description>
      <require condition="LPC4300 CMSIS"/>
      <require Cclass="CMSIS" Cgroup="RTOS"/>
      <require Cclass="Device" Cgroup="SCU"/>
    </condition>

    <condition id="LPC4300 CMSIS SCU GPIO">
      <description>NXP LPC4300 with CMSIS, SCU and GPIO</description>
      <require condition="LPC4300 CMSIS"/>
      <require Cclass="Device" Cgroup="SCU"/>
      <require Cclass="Device" Cgroup="GPIO"/>
    </condition>

    <condition id="LPC4300 CMSIS SCU GPDMA">
      <description>NXP LPC4300 with CMSIS, SCU and GPDMA</description>
      <require condition="LPC4300 CMSIS"/>
      <require Cclass="Device" Cgroup="SCU"/>
      <require Cclass="Device" Cgroup="GPDMA"/>
    </condition>

    <condition id="LPC4300 CMSIS SCU GPIO GPDMA">
      <description>NXP LPC4300 with CMSIS, SCU, GPIO and GPDMA</description>
      <require condition="LPC4300 CMSIS"/>
      <require Cclass="Device" Cgroup="SCU"/>
      <require Cclass="Device" Cgroup="GPIO"/>
      <require Cclass="Device" Cgroup="GPDMA"/>
    </condition>

    <condition id="LPC4300 CMSIS SCU GPIO SPI">
      <description>NXP LPC4300 with CMSIS, SCU, GPIO and SPI</description>
      <require condition="LPC4300 CMSIS"/>
      <require Cclass="Device" Cgroup="SCU"/>
      <require Cclass="Device" Cgroup="GPIO"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.01"/>
    </condition>

    <condition id="LPC4300 CMSIS SCU GPIO SPI Display">
      <description>NXP LPC4300 with CMSIS, SCU, GPIO, SPI and Display</description>
      <require condition="LPC4300 CMSIS SCU GPIO SPI"/>
      <require Cclass="Graphics" Cgroup="Display" Csub="MCBQVGA_LG" Cvariant="RGB IF"/>
    </condition>

    <condition id="LPC4300 CMSIS I2C Driver">
      <description>NXP LPC4300 with CMSIS and I2C Driver</description>
      <require condition="LPC4300 CMSIS"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.02"/>
    </condition>

    <condition id="LPC4300 CMSIS RTOS and I2C Driver">
      <description>NXP LPC4300 with CMSIS, RTOS and I2C Driver</description>
      <require condition="LPC4300 CMSIS"/>
      <require Cclass="CMSIS" Cgroup="RTOS"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.02"/>
    </condition>

    <condition id="LPC4300 CMSIS SCU GPIO SAI/I2C Driver">
      <description>NXP LPC4300 with CMSIS, SCU, GPIO and SAI/I2C Driver</description>
      <require condition="LPC4300 CMSIS"/>
      <require Cclass="Device" Cgroup="SCU"/>
      <require Cclass="Device" Cgroup="GPIO"/>
      <require Cclass="CMSIS Driver" Cgroup="SAI" Capiversion="1.00"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.02"/>
    </condition>

  </conditions>

  <examples>
    <!-- MCB4300 Development Board -->
    <example name="Blinky" doc="Abstract.txt" folder="Boards\Keil\MCB4300\Blinky">
      <description>Blinky example</description>
      <board name="MCB4300" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="Blinky ULp" doc="Abstract.txt" folder="Boards\Keil\MCB4300\Blinky_ULp">
      <description>Blinky ULINKpro example</description>
      <board name="MCB4300" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards\Keil\MCB4300\RTX_Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="MCB4300" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

    <example name="Dual Core CM4 Blinky" doc="Abstract.txt" folder="Boards\Keil\MCB4300\DualCore\CM4">
      <description>Dual Core Cortex-M4 Blinky example</description>
      <board name="MCB4300" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="Dual Core CM0 Blinky" doc="Abstract.txt" folder="Boards\Keil\MCB4300\DualCore\CM0">
      <description>Dual Core Cortex-M0 Blinky example</description>
      <board name="MCB4300" vendor="Keil"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <example name="Demo" doc="Abstract.txt" folder="Boards\Keil\MCB4300\Demo">
      <description>Demo example</description>
      <board name="MCB4300" vendor="Keil"/>
      <project>
        <environment name="uv" load="Demo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
      </attributes>
    </example>
 
