jack77er/openUTRUSTA/Packages/.cache/Keil.LPC4300_DFP.2.5.0.pdsc
    <example name="HTTP Upload" doc="Abstract.txt" folder="Boards\NGX\LPC4330-Xplorer\Middleware\Network\HTTP_Upload" version="1.0.0">
      <description>Web Server with CGI interface and SD/MMC Memory Card as storage media</description>
      <board name="LPC4330-Xplorer" vendor="NGX"/>
      <project>
        <environment name="uv" load="HTTP_Upload.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Web Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Web Server</keyword>
        <keyword>HTTP</keyword>
      </attributes>
    </example>

    <example name="SMTP Client" doc="Abstract.txt" folder="Boards\NGX\LPC4330-Xplorer\Middleware\Network\SMTP_Client" version="1.0.0">
      <description>Example showing how to compose and send emails</description>
      <board name="LPC4330-Xplorer" vendor="NGX"/>
      <project>
        <environment name="uv" load="SMTP_Client.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="SMTP Client"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>SMTP</keyword>
      </attributes>
    </example>

    <example name="SNMP Agent" doc="Abstract.txt" folder="Boards\NGX\LPC4330-Xplorer\Middleware\Network\SNMP_Agent" version="1.0.0">
      <description>Example showing how to use a Simple Network Management Protocol (SNMP)</description>
      <board name="LPC4330-Xplorer" vendor="NGX"/>
      <project>
        <environment name="uv" load="SNMP_Agent.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="SNMP Agent"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>SNMP</keyword>
      </attributes>
    </example>

    <example name="Telnet Server" doc="Abstract.txt" folder="Boards\NGX\LPC4330-Xplorer\Middleware\Network\Telnet_Server" version="1.0.0">
      <description>Command-line Host service example using Telnet protocol</description>
      <board name="LPC4330-Xplorer" vendor="NGX"/>
      <project>
        <environment name="uv" load="Telnet_Server.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Network" Cgroup="Service" Csub="Telnet Server"/>
        <category>Middleware</category>
        <category>Network</category>
        <keyword>Telnet</keyword>
      </attributes>
    </example>

    <example name="File System Demo" doc="Abstract.txt" folder="Boards\NGX\LPC4330-Xplorer\Middleware\FileSystem\File_Demo" version="1.0.0">
      <description>File manipulation example: create, read, copy, delete files on any enabled drive (SD/MMC Card) and format each drive</description>
      <board name="LPC4330-Xplorer" vendor="NGX"/>
      <project>
        <environment name="uv" load="File_Demo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="File System" Cgroup="Drive"/>
        <category>Middleware</category>
        <category>File System</category>
        <keyword>SD/MMC Card</keyword>
      </attributes>
    </example>

  </examples>
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="LPC4300 CMSIS">
      <!-- Cversion is necessary -->
      <description>System Startup for NXP LPC4300 Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_LPC43XX      /* Device Startup for NXP43XX */
      </RTE_Components_h>

      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/LPC43xx.h"/>
        <!-- startup files -->
        <file category="source" name="Device/Source/ARM/startup_LPC43xx.s"       attr="config" condition="CM4 ARM Compiler"/>
        <file category="source" name="Device/Source/ARM/startup_LPC43xx_M0.s"    attr="config" condition="CM0APP ARM Compiler"/>
        <file category="source" name="Device/Source/ARM/startup_LPC43xx_M0Sub.s" attr="config" condition="CM0SUB ARM Compiler"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_LPC43xx.c"    attr="config" condition="CM4"/>
        <file category="source" name="Device/Source/system_LPC43xx_M0.c" attr="config" condition="CM0"/>
        <!-- device configuration required by drivers at the moment -->
        <file category="header" name="RTE_Driver/Config/RTE_Device.h" attr="config" version="2.00"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="SCU" Cversion="1.1" condition="LPC4300 CMSIS">
      <description>SCU driver used by RTE Drivers for LPC4300 Series</description>
      <files>
        <file category="header" name="RTE_Driver/SCU_LPC43xx.h"/>
        <file category="source" name="RTE_Driver/SCU_LPC43xx.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="GPIO" Cversion="1.0" condition="LPC4300 CMSIS">
      <description>GPIO driver used by RTE Drivers for LPC4300 Series</description>
      <files>
        <file category="header" name="RTE_Driver/GPIO_LPC43xx.h"/>
        <file category="source" name="RTE_Driver/GPIO_LPC43xx.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="GPDMA" Cversion="1.4" condition="LPC4300 CMSIS">
      <description>GPDMA driver used by RTE Drivers for LPC4300 Series</description>
      <files>
        <file category="header" name="RTE_Driver/GPDMA_LPC43xx.h"/>
        <file category="source" name="RTE_Driver/GPDMA_LPC43xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="USB0" Capiversion="2.1" Cversion="2.8" condition="LPC4300 CMSIS SCU">
      <description>USB0 Device Driver for the LPC4300 series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBD0_LPC43xx.c"/>
        <file category="source" name="RTE_Driver/USB0_LPC43xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Device" Csub="USB1" Capiversion="2.1" Cversion="2.6" condition="LPC4300 CMSIS SCU">
      <description>USB1 Device Driver for the LPC4300 series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBD1               /* Driver USBD1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBD1_LPC43xx.c"/>
        <file category="source" name="RTE_Driver/USB1_LPC43xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Host" Csub="USB0" Capiversion="2.0" Cversion="2.4" condition="LPC4300 CMSIS SCU">
      <description>USB0 EHCI Host Driver for the LPC4300 series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBH0_LPC43xx.c"/>
        <file category="source" name="RTE_Driver/USB0_LPC43xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="USB Host" Csub="USB1" Capiversion="2.0" Cversion="2.4" condition="LPC4300 CMSIS SCU">
      <description>USB1 EHCI Host Driver for the LPC4300 series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USBH1               /* Driver USBH1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/USBH1_LPC43xx.c"/>
        <file category="source" name="RTE_Driver/USB1_LPC43xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Capiversion="2.1" Cversion="2.6" condition="LPC4300 CMSIS RTOS SCU">
      <description>Ethernet MAC Driver for LPC4300 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_ETH_MAC0            /* Driver ETH_MAC0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/EMAC_LPC43xx.c"/>
      </files>
    </component>

    <component Cclass="CMSIS Driver" Cgroup="MCI" Capiversion="2.2" Cversion="2.5" condition="LPC4300 CMSIS SCU">
      <description>MCI Driver for LPC4300 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_MCI0                /* Driver MCI0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="RTE_Driver/MCI_LPC43xx.c"/>
      </files>
    </component>

